{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Robert Max Rees II WS CBS",
  "language": "en",
  "home_page_url": "https://www.robertmaxrees.com/",
  "feed_url": "https://www.robertmaxrees.com/feed/feed.json",
  "description": "It&#39;s about things!.",
  "author": {
    "name": "Robert Max Rees II WS CBS",
    "url": "https://www.robertmaxrees.com/about-me/"
  },
  "items": [{
      "id": "https://www.robertmaxrees.com/posts/february2025Retrospective/",
      "url": "https://www.robertmaxrees.com/posts/february2025Retrospective/",
      "title": "February 2025 Retrospective",
      "content_html": "<p>It's time.  Really.  A one-two combo that's both a reflection on my current state of affairs, as well as my own <a href=\"https://www.youtube.com/watch?v=RYlCVwxoL_g\">invocation for beginnings</a>.</p>\n<h2 id=\"what-why\" tabindex=\"-1\">What Why <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/february2025Retrospective/#what-why\" aria-hidden=\"true\">#</a></h2>\n<p>Publishing <em>details</em> about <em>yourself</em> and <em>your feelings</em> onto <em>the internet</em> is a ritual ingrained in early-2000's LiveJournal (or DeadJournal) blogs.  My deeply-online millennial brain can't resist that kind of return to form, though this time perhaps I'll exercise discretion and hold a more critical eye to my own actions.</p>\n<p>Part of my hope in doing this is that it'll hold me at least somewhat accountable to my goals and aspirations.  It also forces me to re-think and reconsider myself through the lense of writing, an act that is equal parts uncomfortable and revealing.  I'm doing this now for a variety of reasons - one of my larger motivations rests in knowing that sometimes I need to just start.  I told myself post-another-blog-relaunch I'd write more.  So here I am.  Writing.</p>\n<p>This covers a lot of ground.  Some of these are serious, others less so.  As much of this is about future state, despite what the title might suggest.</p>\n<h2 id=\"sometimes-big-things-happen-at-work\" tabindex=\"-1\">Sometimes Big Things Happen At Work <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/february2025Retrospective/#sometimes-big-things-happen-at-work\" aria-hidden=\"true\">#</a></h2>\n<p>We recently launched a major rebrand replete with new logo, colors, domain, and naming.  It's been a long road.  Now that we're on the other end, we can breathe.  Let's refocus on the simpler stuff and get back at it.  And let me remember to separate work from real life the same way I encourage my employees to.</p>\n<p>Operations will be a primary focus area.  I want to make sure we simplify and streamline the day-to-day so we save our mental and emotional energies on the stuff that matters.  It'll be a long road, but I see some major benefits in the short-to-medium term.</p>\n<h2 id=\"new-musical-projects-are-very-good-for-you-actually-probably\" tabindex=\"-1\">New Musical Projects Are Very Good For You, Actually.  Probably. <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/february2025Retrospective/#new-musical-projects-are-very-good-for-you-actually-probably\" aria-hidden=\"true\">#</a></h2>\n<p>For the last 15 plus years, I've endeavored to make more music.  Originals.  But also covers.  Different genres.  In and out of my comfort zone.  There's a handful of things I want to record.  I have the setup to do it.  I've even gotten started a few times!  But more often than not, I fall into the trap of overthinking.  Nitpicking parts.  EQing prematurely.  Organizing DAW windows.  Premature production.</p>\n<p>All the stuff that isn't <em>actually making music</em>.</p>\n<p>There's also the worry that whatever I put out won't be good.  To whom, I'm not sure.  And that I expect to be perfect out of the gate is unrealistic.  Flex the muscle.  Work it.  Do more of it.  Focus on getting it down.  Re-record parts later.  Just do.  Practice what I preach to the kids - it's great being bad at things.  That's how we learn.</p>\n<p>Doing more of this is in the works.  There are a few musical ideas floating around in my head in various stages of forméd-ness that I need to simply start.  Just start.  Like the writing I'm doing here.  Start.</p>\n<h2 id=\"things-what-make-the-good-chemicals-happen-in-the-thinky-brain-meats\" tabindex=\"-1\">Things What Make The Good Chemicals Happen In The Thinky Brain Meats <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/february2025Retrospective/#things-what-make-the-good-chemicals-happen-in-the-thinky-brain-meats\" aria-hidden=\"true\">#</a></h2>\n<p>Mental health is a regular star in my internal world of struggles.  There are a handful of distinct problems/issues that need addressing.  Some are underway already.  Others are pending.  Of these, getting out of the house is a major theme.  Working from home full time is a double-edged sword.  Though the convenience is top notch, it also means that the majority of realtime human interaction happens either during video calls with colleagues <em>or</em> with the members of my household.  It also means my world happens largely in the confines of the set of walls that comprise my house.</p>\n<p>This is non-ideal.</p>\n<p>And so, I need to leave the house more.  Axe throwing is something that I've found a predilection for.  We have <a href=\"https://hatchethousechico.com/\">a local club</a>.  Let's do that more often.  Same with just getting out into nature a time or two a week.  Go out to a park, sit down, and write.  Or don't.  Just be in not the house.</p>\n<p>Also see above note re: music stuff.  That's a biggie.</p>\n<p>There's also the intrinsic link between physical health and mental/emotional health.  Eat better.  Get exercise.  Lose weight.  Simple actions, but they add up.</p>\n<p>Lastly, my prior excursions into the world of Zen, particularly the practice of shikantaza.  Making space to do this daily has been borderline transformative for me historically.  Let's give it another go.</p>\n<p>Collectively, these are deliberate and intentional actions.</p>\n<p>Another major consideration for me is to unlock a bit of the anxieties I have around doing these things.  That stuff runs deep, but hopefully my time in therapy can help me unlock at least some of it and move through.  Of note is that I've allowed my family to become an excuse - &quot;I can't because of the kids&quot; or &quot;but what about the house?&quot; aren't very good reasons when it's about taking care of yourself.  They can't be OK if you're not OK.</p>\n<h2 id=\"death-seriously-sucks\" tabindex=\"-1\">Death Seriously Sucks <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/february2025Retrospective/#death-seriously-sucks\" aria-hidden=\"true\">#</a></h2>\n<p>I published a piece late last year <a href=\"https://www.robertmaxrees.com/posts/ongrief/\">touching on the subject of grief</a>.  It was fueled in part by bearing witness to my partner experiencing her first major loss - her mother.  Myriad family and friend dynamics came to the forefront, many beautiful, some less so.  This event also forced me to re-examine and reflect upon the other deaths I've experienced in new ways.</p>\n<p>It's tough.  I've lost close friends and acquaintances.  Participated in other's grief for their loved ones.  I lost both of my parents relatively young, both at wildly different points in my life.  As time goes on (something I've tried to prevent but have failed at <em>many times</em>), my relationship to those events has changed.  After my partner moved in with the kids, so began a new chapter in that process.</p>\n<p>Grief is certainly a process.  It's never done.  Like life, it's a journey, and finding your path through it (traumas and all) is a crucial step in accepting that it's just kinda gonna be there forever.</p>\n<p>Parenthood has been a trip.  Through it, not only have I been challenged in notions of correct vs. incorrect, right vs. wrong, awesome vs. terrible, I've also been forced to directly confront my own grief.  And through moments of connecting with the kids, I've reconnected with my own parents.  In one recent case, I was teaching the youngest how to sew a button back onto a shirt - she'd been doing various crafts using paper and staples, making objects like small purses.  I realized that the act of sewing might be appealing.  She learned how to thread the needle, tie off the thread, push it through the fabric and button without poking herself, etc.  And in that, I remembered my dad showing me the same thing; I remembered my mom spending hours at the sewing machine making halloween costumes.  I remembered little happy slivers of my own childhood.</p>\n<p>The recent death hit very close to home and forced me into an uncomfortable space emotionally and mentally.  I need to keep exploring these things and keep them in check.  Speaking of which.</p>\n<h3 id=\"spring-s-tough-every-year-dummy\" tabindex=\"-1\">Spring's Tough Every Year, Dummy <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/february2025Retrospective/#spring-s-tough-every-year-dummy\" aria-hidden=\"true\">#</a></h3>\n<p>I forget this every year - my parents both had birthdays in the Spring, and they both passed away during Spring.  <em>It's why you feel funky</em>.</p>\n<h2 id=\"reassess-re-evaluate\" tabindex=\"-1\">Reassess, Re-evaluate <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/february2025Retrospective/#reassess-re-evaluate\" aria-hidden=\"true\">#</a></h2>\n<p>Through all of this, it's important to keep moving forward.  Take a pause and ask &quot;is this working?&quot;  Checking in with myself and sitting with my feelings are going to be large parts of this process.  Do the work.  Change what needs to be changed.  Build up the momentum and keep moving forward.</p>\n<h2 id=\"fin-probably\" tabindex=\"-1\">Fin, probably <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/february2025Retrospective/#fin-probably\" aria-hidden=\"true\">#</a></h2>\n<p>This is by no means exhaustive.  There are plenty of items that I'm choosing not to reveal here.  Things I'm keeping close.  But for now, here we go.  Now a big breath and...</p>\n<p>Post</p>\n",
      "date_published": "2025-02-27T00:00:00Z"
    },{
      "id": "https://www.robertmaxrees.com/posts/yearinwhiskey2024/",
      "url": "https://www.robertmaxrees.com/posts/yearinwhiskey2024/",
      "title": "Year in Whiskey 2024",
      "content_html": "<p>My journey this year with whiskey was intended to be one of exploring and rediscovering core expressions.  Easy to find releases from distilleries that are approachable and don't require an iron palate to get past the proof.  Accessible and maybe even more delicate!</p>\n<p>This did not happen.  Mostly.</p>\n<p>I'm not too upset out it, though!  There are a lot of great distilleries doing a lot of kickass work.  While there were a lot of impressive releases this year, I also got my hands on some things from years past that were notable.  My list is by no means exhaustive, nor is it intended as any kind of <em>best of</em>.  Just some things that made me think a bit, for better or worse.</p>\n<h2 id=\"bruichladdich-black-art-10-1\" tabindex=\"-1\">Bruichladdich Black Art 10.1 <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/yearinwhiskey2024/#bruichladdich-black-art-10-1\" aria-hidden=\"true\">#</a></h2>\n<p>Graciously supplied with a sample from a friend, this does not fit into what most folks would expect from an Islay.  The final release by Adam Hannett, this 2022 edition is delightful.  I have no others to compare to and as such have zero calibration for what Black Art releases really are.  However, this is <em>damn fine whisky</em>.  Though the age statement pins this one at 29 years, the nose and palate are quite lively.  Mastery of the art of blending is on full display, with all aromas and flavors being so well integrated that it's akin to a brilliantly composed symphony.  You can hear what the second violin is playing compared to the horns, but you can also pick apart that 3rd violin part, too.</p>\n<p>Thought provoking not only in how brilliantly constructed it is, this is also the rare release from Bruichladdich in which they are tight-lipped about it's details.  No QR codes or pages talking about where the grain was grown and the name of the cow whose manure was used oin those fields.  While this certainly adds a level of intrigue, it may also be a matter of practicality - these releases are composed of spirits produced pre-reopening.  It could be that all they really know and can guarantee is what they smell and taste, so the lack of details isn't just a &quot;we won't tell you&quot;, but also a &quot;we're not 100% sure&quot;.  Whatever the case, this stuff is great.  Just, y'know, be mindful of the price on these.</p>\n<h2 id=\"wild-turkey-8-year-old-jimmy-russel-70th-anniversary\" tabindex=\"-1\">Wild Turkey 8 Year Old Jimmy Russel 70th Anniversary <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/yearinwhiskey2024/#wild-turkey-8-year-old-jimmy-russel-70th-anniversary\" aria-hidden=\"true\">#</a></h2>\n<p>Wild Turkey's releases never disappoint.  Their Russel's Reserve Private Barrel line was another hitter this year, but I'm featuring this Wild Turkey release because, frankly, it's phenomenal.  101 proof, 8 years old, widely available.  Yes please.</p>\n<p>Kentucky bourbons are at their best in the 8-12 year range.  Any higher and they can quickly become overly tannic and astringent or excessively honeyed and sweet.  Much lower and you run the risk of being overly grainy.  By clocking in at 8 years, you get something that has the signature Wild Turkey house style.  It's approachable and softer than the proof suggests, and the price to quality ratio is about right.  They balance oak tannin and sugars excellently, leaving you with a superb bourbon that won't punch you in the face with it's proof.  I've bought more than one, and will miss it once gone.</p>\n<h2 id=\"knob-creek-12-year-and-knob-creek-single-barrel-select\" tabindex=\"-1\">Knob Creek 12 Year and Knob Creek Single Barrel Select <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/yearinwhiskey2024/#knob-creek-12-year-and-knob-creek-single-barrel-select\" aria-hidden=\"true\">#</a></h2>\n<p>These both are excellent examples for the label.  A devout Knob Creek fanboy, the standard 9 year release is always available in my home.  It's my decanter whiskey.  The 12 year takes everything I like about the 9 and makes it slightly more refined.  The rough edges have been hit with a rasp (though not completely sanded off), revealing a pour that's more subtle, more integrated, and almost more complex.  It's still Knob Creek, just it's slightly older, more experienced sibling.</p>\n<p>I say that all in contrast to the 15 year release.  It's overly honeyed, with the oak and sweetness both amped up a little too much.  While still good, the 15 year just misses the mark.  15 for the novelty, 12 for the quality.  That being said, I'm really curious to see what the 18 year offers.  For science.</p>\n<p>And Knob Creek Single Barrel Select.  These are regular releases that offer up 20 more proof points.  Some call it &quot;Booker's but cheaper&quot; which might be a little hyperbolic, but also not entirely off the mark.  Every time I find one, I know it's going to be excellent.  Beam's handling of higher proofs is always a treat.  If you haven't had it (or it's been a while), give it a go.  It's well worth it.  Another example of the price to performance ratio being very on-the-mark.</p>\n<h2 id=\"frey-ranch-farm-strength\" tabindex=\"-1\">Frey Ranch Farm Strength <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/yearinwhiskey2024/#frey-ranch-farm-strength\" aria-hidden=\"true\">#</a></h2>\n<p>Another high proof example, Frey Ranch had a great year.  These single barrel cask strength releases put their entire process on full display.  I got my hands on releases in the 130 proof range, and they did not disappoint.  Their 4-grain bill adds a distinct character, giving black pepper and grain qualities you don't often see.  Their willingness to produce a spirit that is uniquely their own, instead of chasing the profiles of other distilleries or regions, combined with the sheer quality of that spirit is promising not only for them, but for the craft scene as a whole.</p>\n<p>They run the whole operation on-site, starting with growing their own grains.  The result is unique, potent, and enjoyable.  Prices <em>can</em> be a touch on the high side, but given their current scale and relative quality, I'm not mad about it.</p>\n<h2 id=\"kirkland-lowland-single-malt-sherry-cask-finish\" tabindex=\"-1\">Kirkland Lowland Single Malt Sherry Cask Finish <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/yearinwhiskey2024/#kirkland-lowland-single-malt-sherry-cask-finish\" aria-hidden=\"true\">#</a></h2>\n<p>A bottling that shouldn't have surprised me but still did.  This Alexander Murray &amp; Co. bottling is delightful.  Lowland Scotch doesn't make waves like their Highland, Speyside, Islay, Campbeltown, or even Island siblings (so, like, everything else in Scotland), but releases like demonstrate that the region's got some excellent products available.</p>\n<p>It's not high proof.  It's not a sherry bomb.  It's not the most mind-blowing experience ever.  It's just damn good.  Bourbon and sherry cask influences are balanced.  The distillate quality and cask management were well handled.  And the price point was more than reasonable.  I can highly recommend this to those looking for a solid Scotch experience.  Bravo.</p>\n<h2 id=\"lost-spirits-abomination-slayers-of-the-law\" tabindex=\"-1\">Lost Spirits Abomination Slayers of the Law <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/yearinwhiskey2024/#lost-spirits-abomination-slayers-of-the-law\" aria-hidden=\"true\">#</a></h2>\n<p>Finally, this strange beast.  It's not legally whisky.  TTB's classifications are frustrating - that Maker's 46, Fireball, Basil Hayden Dark Rye, and Angel's Envy are all considered the same thing is it's own can of worms, but this release gave me pause to consider the question &quot;what is whiskey?&quot; at a level that I hadn't in a while.</p>\n<p>So much of our definitions of whiskey are tied to how it's made.  100% grain mash that's then distilled under some upper limit of ABV, then tossed into a (usually oak) cask, and eventually bottled usually higher than 40%.  Nothing other than grain, yeast, and water (and enzymes) allowed...  That sheer amount of parentheticals should highlight the beginnings of my miniature internal crisis on this subject.  This Lost Spirits release takes everything a step further by putting sourced peated Scottish spirit through a special machine that tries to &quot;rapid age&quot; it with charred oak chips that had some level of contact with a late harvest riesling.</p>\n<p>Taking a step back, the results in the glass are good.  Not great, not amazing, but good.  Lost Spirits touts that their special THEA One reactor process creates something that has the same chemical fingerprint as a 15-year-old whisky.  That may or may not be true - I don't have access to a mass spectrometer to analyze this with.  What I do have are a nose and mouth that have experienced a lot of whisky.  Experientially, this smells, tastes, and finishes like a peated Islay malt.  Not an excellent one, but it's not bad, either.  Very middle-of-the-road, with nothing too funky going on.</p>\n<p>Shit.</p>\n<p>So what <em>is</em> whisky?</p>\n<h2 id=\"this-year-s-major-question-what-is-whiskey\" tabindex=\"-1\">This year's major question: What is whiskey? <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/yearinwhiskey2024/#this-year-s-major-question-what-is-whiskey\" aria-hidden=\"true\">#</a></h2>\n<p>Parsing this question leads to two different, basic answers:</p>\n<ul>\n<li>The result in the glass is all that matters.  If it walks like a duck, sounds like a duck...</li>\n<li>Where, how, and when are as important as the raw materials.  Otherwise it's a facsimile, no matter how spot on.</li>\n</ul>\n<p>I <em>think</em> I know where I sit on this one, but it's an important conversation to be having as we charge into the future.  New and different treatment processes will continue to come up, and they will all have varying levels of success.  While these often <em>can</em> simulate certain aspects of the aging process, there's one thing they still do not (and potentially never can) do: replace time.  There are chemical processes that cannot be sped up without having other, often detrimental, affects to the resultant liquid.  We can extract oak character, sure, but we cannot replace the cascade of interactions that occur over extended periods of time within a cask.</p>\n<p>That probably reveals my opinion on the matter, but there's also a new world of exploration available.  In the US, TTBs current classification framework is woefully inadequate, and it will only get worse as time goes on.  Though I do applaud their recent ratification of the American Single Malt category, I worry that there's so much else they aren't accounting for.</p>\n<p>Let's consider the following options:</p>\n<ul>\n<li>Knob Creek 9 year, a bourbon</li>\n<li>Maker's 46, a bourbon that had french oak staves inserted into the barrel</li>\n<li>Glenfarclas 105, a scotch that leverages ex-sherry casks</li>\n<li>Basil Hayden Dark Rye, a rye that's been blended with a small percentage of port wine</li>\n<li>Cascade Moon, a single barrel Tennessee spirit that would be a whiskey except that it comes from the barrel at under 40% abv</li>\n<li>Fireball, a canadian whisky that adds sweeteners and flavorings</li>\n<li>Lost Spirits Abomination, a peated Islay spirit that goes into a machine with charred oak chips that touched riesling</li>\n</ul>\n<p>Of these, only 2 are classified by TTB in the US as &quot;Whiskey&quot;.  Of those 2, one is a Scotch that, if made stateside, would not be classified as a whiskey.  More strangely, the &quot;non-whiskey&quot; options all fall under the catch-all classification of &quot;Distilled Spirits Specialty&quot;.  In the eyes of the law, Fireball and Maker's 46 are the same category.</p>\n<p>Wat.</p>\n<p>In Scottish rules, what you put the grain-based distillate into doesn't matter so long as it's oak.  It doesn't matter if it's new charred oak or if it held something prior.  Heck, you can age it in one cask, and then move it to another.  Stateside, however, the moment you dump a barrel containing bourbon is sacrosanct.  Bottle that, you're good to go.  The act of putting that into, say, a spent port cask (a la Angel's Envy) and suddenly it's legally not even whiskey any more.  Ditto even if you put it into another charred new oak container.  That, too, makes it Not Whiskey any more.</p>\n<p>This lengthy tangent is a short version - I'll share a deeper dive in the future.  The point here is that exploring the question of &quot;What is whiskey?&quot; requires some deep contemplation.  What are the guard rails and limitations we truly need to care about?  Which ones aren't that important?  Where do we draw the lines?  Or do the lines even need to exist?</p>\n<h2 id=\"in-summation\" tabindex=\"-1\">In summation <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/yearinwhiskey2024/#in-summation\" aria-hidden=\"true\">#</a></h2>\n<p>There were plenty of other things I had this year that I enjoyed and/or made me think.  I didn't include them above because I had to cut things off somewhere.  Here were my other selections:</p>\n<ul>\n<li>Laphroaig 25 2018</li>\n<li>Jack Daniel's Single Barrel Barrel Proof Rye</li>\n<li>Stellum Single Barrel</li>\n<li>Maker's Mark Generations of Proof</li>\n<li>Doc Swinson's, Smoke Wagon, Old Elk (And other damn good MGP-sourced releases)</li>\n<li>Humboldt Craft Spirits Redwood Rye</li>\n</ul>\n<p>Those JD Single Barrel Barrel Proof Rye releases are a wild ride, both in name length and proof.  The Stellum lineup is great - I'd expect nothing less from Barrell Craft Spirits.  Some NDPs are doing great work, though honestly Old Elk <em>is</em> cheating a bit, in that they're sourcing barrels from MGP that the founder of Old Elk had made while he was working at MGP.  Finally, that Humboldt Craft Spirits Rye was an impulse buy that was of much higher quality than I expected.</p>\n<p>This was a year that challenged my notions surrounding &quot;What is whiskey?&quot; while also offering up a ton of great sips that gave me something to quaff while pondering.  It's a great time in the world of brown booze, and I learned a lot.  I may not yet have answers, but that's okay.  Gives me something to think about while I sip away.</p>\n",
      "date_published": "2024-12-20T00:00:00Z"
    },{
      "id": "https://www.robertmaxrees.com/posts/ongrief/",
      "url": "https://www.robertmaxrees.com/posts/ongrief/",
      "title": "On Grief",
      "content_html": "<p>Was getting some thoughts down and reflecting on my own experiences with grief.  It's a traumatic, awful, frustrating thing that can also bring perspective, clarity, and beauty.  Thought I'd share here for those who might need it.  It's not a prescribed path.  It's simply what I wish I'd known for myself.  Maybe others need this, too.</p>\n<p>Grief, like life, is a journey and not a destination.  It's a major part of how people occupy the space in our hearts and minds when their corporeal form ceases to be what it once was.</p>\n<p>So often we get wrapped up in the grand cosmic underpinnings, the metaphysical explorations, the pure science and logic, or even the avoidance of these things, that we forget about the people in our midst.  We forget the human connections.  We turn inward and put up barriers in an effort to protect ourselves.  This can be a pernicious cycle, because it can remove you from the three most important connections of all:</p>\n<ul>\n<li>The one with the person you are experiencing grief in connection to</li>\n<li>The one with the surrounding people through whom the memory and the legacy will continue through</li>\n<li>The one with yourself as you confront what you once thought unimaginable</li>\n</ul>\n<p>Maintaining those connections is so important, but need not happen at the expense of yourself.  You can take time and care for yourself.  You can be a mess or be overly put together.  You can have boundaries (though ensure these do not become conditions).  About the only real rule is &quot;whatever you do, don't take away from another's process&quot;.</p>\n<p>Above all, walk the path.  Participate in it to the best of your abilities.  Get a little uncomfortable - that discomfort is where the growth will happen.  And keep pushing.  Push forward, push yourself to something greater, push yourself aside when your own agenda and motivations might not be in alignment with needs.\nAnd don't forget that tomorrow, sometimes despite (or even in spite of) our best efforts otherwise, will always come.</p>\n",
      "date_published": "2024-11-25T00:00:00Z"
    },{
      "id": "https://www.robertmaxrees.com/posts/onhumanleadership/",
      "url": "https://www.robertmaxrees.com/posts/onhumanleadership/",
      "title": "On Human Leadership",
      "content_html": "<p>The story happens far too often - so much so that it's something of a clichéd joke in technology circles.  A great IC is taken from their current seat and turned into a Manager.  Higher ups think that an aptitude for doing the job itself is what makes for a great manager, so surely they should take their top performers and give them the title and make them responsible for a team, right?</p>\n<h2 id=\"this-is-always-a-big-mistake\" tabindex=\"-1\">This is always a big mistake <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/onhumanleadership/#this-is-always-a-big-mistake\" aria-hidden=\"true\">#</a></h2>\n<p>The skillset an IC often spends their career working on is centered around programming paradigms, design patterns, techniques, etc.  While these are great skills, they're all focused on technology.  As a result, they are ill-equipped to handle key duties inherent to the role of human leadership.</p>\n<p>Human leadership, especially within larger orgs, should be centered around themes of translating and operationalizing strategy; on coaching and mentoring; on active listening and problem solving.  It's about cultivating an environment where great things can (and often do!) happen simply because you've got the right people working on the right problems at the right times.</p>\n<h2 id=\"humans-and-organizations-are-not-computers\" tabindex=\"-1\">Humans and organizations are not computers <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/onhumanleadership/#humans-and-organizations-are-not-computers\" aria-hidden=\"true\">#</a></h2>\n<p>While you can think of an organization solely as a system, that ignores the reality that people are doing the work.  People have their own desires, goals, wants, needs, motivations.  And your job as a leader is to address those needs and meet them where you can.  Your job focuses on the working conditions of your people in total.  Put different, your career is about other people's jobs.</p>\n<p>You need to pay special care and attention to that particular role, because the people around you - <em>especially</em> the ICs, will hold a view that colors how they interact with you and your directions.  And this can be ruinous, because it can rob those same ICs of opportunities to grow and develop.  At it's worst, the ICs will simply refrain from speaking up entirely for fear that disagreeing or dissenting will get them in some kind of trouble.</p>\n<h3 id=\"technology-leadership-and-human-leadership-are-separate-roles\" tabindex=\"-1\">Technology leadership and human leadership are separate roles <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/onhumanleadership/#technology-leadership-and-human-leadership-are-separate-roles\" aria-hidden=\"true\">#</a></h3>\n<p>Humans have a quirk in that they often see people speaking from a place of authority as inherently either more &quot;correct&quot; or that they hold special authority in all decisions.  Either the manager is much smarter than everybody else, or we must do as they say simply because they hold The Title™.  As noted, this is bad.  Don't let it happen.  Human leaders should only dive into technology decisions when progress is stopped, and only then they should ultimately enable and encourage their people to determine the best path forward.</p>\n<p>You'll note that there's a distinction in that title up there between &quot;technology leadership&quot; and &quot;human leadership&quot;.  Your company should have two separate career tracks for associates to follow.</p>\n<h2 id=\"how-to-fix-the-problem\" tabindex=\"-1\">How to fix the problem <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/onhumanleadership/#how-to-fix-the-problem\" aria-hidden=\"true\">#</a></h2>\n<p>Specifics around job titles vary from org to org, but generally speaking there should be a point at which an engineer stands to make a decision about their career.  Either they continue on the technical track and develop into an architecture/principal role (technology leadership), or they jump into a management role (human leadership).  By separating out human leadership from technology leadership, you create effective checks and balances between the two camps.</p>\n<p>Another effective tools is adopting the Product Operating Model, a subject near and dear to my heart.  It's transformed the way our organization works and, when properly implemented, leads to positive, lasting changes that lead to better outcomes not only in the quality of what you build, but also in associate satisfaction.  We'll talk more about these in the future.</p>\n",
      "date_published": "2024-09-09T00:00:00Z"
    },{
      "id": "https://www.robertmaxrees.com/posts/firstpost/",
      "url": "https://www.robertmaxrees.com/posts/firstpost/",
      "title": "A site rebuild",
      "content_html": "<p>I'm starting my site over.  Again.  Because I want to.</p>\n<h2 id=\"hey-look-a-header\" tabindex=\"-1\">Hey look, a header <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/firstpost/#hey-look-a-header\" aria-hidden=\"true\">#</a></h2>\n<p>We'll see how this goes.</p>\n",
      "date_published": "2024-09-09T00:00:00Z"
    }
  ]
}
