{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Robert Max Rees II WS CBS",
  "language": "en",
  "home_page_url": "https://www.robertmaxrees.com/",
  "feed_url": "https://www.robertmaxrees.com/feed/feed.json",
  "description": "It&#39;s about things!.",
  "author": {
    "name": "Robert Max Rees II WS CBS",
    "url": "https://www.robertmaxrees.com/about-me/"
  },
  "items": [{
      "id": "https://www.robertmaxrees.com/posts/ongrief/",
      "url": "https://www.robertmaxrees.com/posts/ongrief/",
      "title": "On Grief",
      "content_html": "<p>Was getting some thoughts down and reflecting on my own experiences with grief.  It's a traumatic, awful, frustrating thing that can also bring perspective, clarity, and beauty.  Thought I'd share here for those who might need it.  It's not a prescribed path.  It's simply what I wish I'd known for myself.  Maybe others need this, too.</p>\n<p>Grief, like life, is a journey and not a destination.  It's a major part of how people occupy the space in our hearts and minds when their corporeal form ceases to be what it once was.</p>\n<p>So often we get wrapped up in the grand cosmic underpinnings, the metaphysical explorations, the pure science and logic, or even the avoidance of these things, that we forget about the people in our midst.  We forget the human connections.  We turn inward and put up barriers in an effort to protect ourselves.  This can be a pernicious cycle, because it can remove you from the three most important connections of all:</p>\n<ul>\n<li>The one with the person you are experiencing grief in connection to</li>\n<li>The one with the surrounding people through whom the memory and the legacy will continue through</li>\n<li>The one with yourself as you confront what you once thought unimaginable</li>\n</ul>\n<p>Maintaining those connections is so important, but need not happen at the expense of yourself.  You can take time and care for yourself.  You can be a mess or be overly put together.  You can have boundaries (though ensure these do not become conditions).  About the only real rule is &quot;whatever you do, don't take away from another's process&quot;.</p>\n<p>Above all, walk the path.  Participate in it to the best of your abilities.  Get a little uncomfortable - that discomfort is where the growth will happen.  And keep pushing.  Push forward, push yourself to something greater, push yourself aside when your own agenda and motivations might not be in alignment with needs.\nAnd don't forget that tomorrow, sometimes despite (or even in spite of) our best efforts otherwise, will always come.</p>\n",
      "date_published": "2024-11-25T00:00:00Z"
    },{
      "id": "https://www.robertmaxrees.com/posts/onhumanleadership/",
      "url": "https://www.robertmaxrees.com/posts/onhumanleadership/",
      "title": "On Human Leadership",
      "content_html": "<p>The story happens far too often - so much so that it's something of a clichéd joke in technology circles.  A great IC is taken from their current seat and turned into a Manager.  Higher ups think that an aptitude for doing the job itself is what makes for a great manager, so surely they should take their top performers and give them the title and make them responsible for a team, right?</p>\n<h2 id=\"this-is-always-a-big-mistake\" tabindex=\"-1\">This is always a big mistake <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/onhumanleadership/#this-is-always-a-big-mistake\" aria-hidden=\"true\">#</a></h2>\n<p>The skillset an IC often spends their career working on is centered around programming paradigms, design patterns, techniques, etc.  While these are great skills, they're all focused on technology.  As a result, they are ill-equipped to handle key duties inherent to the role of human leadership.</p>\n<p>Human leadership, especially within larger orgs, should be centered around themes of translating and operationalizing strategy; on coaching and mentoring; on active listening and problem solving.  It's about cultivating an environment where great things can (and often do!) happen simply because you've got the right people working on the right problems at the right times.</p>\n<h2 id=\"humans-and-organizations-are-not-computers\" tabindex=\"-1\">Humans and organizations are not computers <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/onhumanleadership/#humans-and-organizations-are-not-computers\" aria-hidden=\"true\">#</a></h2>\n<p>While you can think of an organization solely as a system, that ignores the reality that people are doing the work.  People have their own desires, goals, wants, needs, motivations.  And your job as a leader is to address those needs and meet them where you can.  Your job focuses on the working conditions of your people in total.  Put different, your career is about other people's jobs.</p>\n<p>You need to pay special care and attention to that particular role, because the people around you - <em>especially</em> the ICs, will hold a view that colors how they interact with you and your directions.  And this can be ruinous, because it can rob those same ICs of opportunities to grow and develop.  At it's worst, the ICs will simply refrain from speaking up entirely for fear that disagreeing or dissenting will get them in some kind of trouble.</p>\n<h3 id=\"technology-leadership-and-human-leadership-are-separate-roles\" tabindex=\"-1\">Technology leadership and human leadership are separate roles <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/onhumanleadership/#technology-leadership-and-human-leadership-are-separate-roles\" aria-hidden=\"true\">#</a></h3>\n<p>Humans have a quirk in that they often see people speaking from a place of authority as inherently either more &quot;correct&quot; or that they hold special authority in all decisions.  Either the manager is much smarter than everybody else, or we must do as they say simply because they hold The Title™.  As noted, this is bad.  Don't let it happen.  Human leaders should only dive into technology decisions when progress is stopped, and only then they should ultimately enable and encourage their people to determine the best path forward.</p>\n<p>You'll note that there's a distinction in that title up there between &quot;technology leadership&quot; and &quot;human leadership&quot;.  Your company should have two separate career tracks for associates to follow.</p>\n<h2 id=\"how-to-fix-the-problem\" tabindex=\"-1\">How to fix the problem <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/onhumanleadership/#how-to-fix-the-problem\" aria-hidden=\"true\">#</a></h2>\n<p>Specifics around job titles vary from org to org, but generally speaking there should be a point at which an engineer stands to make a decision about their career.  Either they continue on the technical track and develop into an architecture/principal role (technology leadership), or they jump into a management role (human leadership).  By separating out human leadership from technology leadership, you create effective checks and balances between the two camps.</p>\n<p>Another effective tools is adopting the Product Operating Model, a subject near and dear to my heart.  It's transformed the way our organization works and, when properly implemented, leads to positive, lasting changes that lead to better outcomes not only in the quality of what you build, but also in associate satisfaction.  We'll talk more about these in the future.</p>\n",
      "date_published": "2024-09-09T00:00:00Z"
    },{
      "id": "https://www.robertmaxrees.com/posts/firstpost/",
      "url": "https://www.robertmaxrees.com/posts/firstpost/",
      "title": "A site rebuild",
      "content_html": "<p>I'm starting my site over.  Again.  Because I want to.</p>\n<h2 id=\"section-header\" tabindex=\"-1\">Section Header <a class=\"direct-link\" href=\"https://www.robertmaxrees.com/posts/firstpost/#section-header\" aria-hidden=\"true\">#</a></h2>\n<p>We'll see how this goes.</p>\n",
      "date_published": "2024-09-09T00:00:00Z"
    }
  ]
}
